app/controllers/question_controller.rb

SELECT "user_queries".* FROM "user_queries" WHERE "user_queries"."email" = ?  [["email", "admin@example.com"]]
---
  def retrive
    @prev_data= UserQuery.where(email: current_user.email)